MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_i2c.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_i2c.c
 **
 ** A detailed description is available at
 ** @link I2cGroup Inter-Integrated Circuit(I2C) description @endlink
 **
 **   - 2018-10-16  1.0  Wangmin  First version for Device Driver Library of I2C.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_i2c.h"
#include "hc32f46x_utility.h"

#if (DDL_I2C_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup I2cGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define I2C_BAUDRATE_MAX (400000ul)

/*! Parameter validity check for unit. */
#define IS_VALID_UNIT(x) \
    (((x) == M4_I2C1) || \
     ((x) == M4_I2C2) || \
     ((x) == M4_I2C3))

/*! Parameter check for I2C baudrate value !*/
#define IS_VALID_SPEED(speed) ((speed) <= (I2C_BAUDRATE_MAX))

/*! Parameter check for I2C baudrate calculate prccess !*/
#define IS_VALID_FDIV(fdiv) ((fdiv) <= 128.0f)
#define IS_VALID_BAUDWIDTH(result) ((result) == true)
/*! Parameter check for Function state !*/
#define IS_VALID_FUNCTION_STATE(x) \
    (((x) == Disable) ||           \
     ((x) == Enable))

/*! Parameter check for Digital filter config !*/
#define IS_VALID_DIGITAL_FILTER(x) \
    (((x) == Filter1BaseCycle) ||  \
     ((x) == Filter2BaseCycle) ||  \
     ((x) == Filter3BaseCycle) ||  \
     ((x) == Filter4BaseCycle))

/*! Parameter check for address mode !*/
#define IS_VALID_ADRMODE(x) \
    (((x) == Adr7bit) ||    \
     ((x) == Adr10bit))

/*! Parameter check for Time out control switch !*/
#define IS_VALID_TIMOUT_SWITCH(x) \
    (((x) == TimeoutFunOff) ||    \
     ((x) == LowTimerOutOn) ||    \
     ((x) == HighTimeOutOn) ||    \
     ((x) == BothTimeOutOn))

/*! Parameter check for I2C 7 bit address range !*/
#define IS_VALID_7BIT_ADR(x) ((x) <= 0x7F)

/*! Parameter check for readable I2C status bit !*/
#define IS_VALID_RD_STATUS_BIT(x)   \
    (((x) == I2C_SR_STARTF) ||      \
     ((x) == I2C_SR_SLADDR0F) ||    \
     ((x) == I2C_SR_SLADDR1F) ||    \
     ((x) == I2C_SR_TENDF) ||       \
     ((x) == I2C_SR_STOPF) ||       \
     ((x) == I2C_SR_RFULLF) ||      \
     ((x) == I2C_SR_TEMPTYF) ||     \
     ((x) == I2C_SR_ARLOF) ||       \
     ((x) == I2C_SR_NACKDETECTF) || \
     ((x) == I2C_SR_NACKSENDF) ||   \
     ((x) == I2C_SR_TMOUTF) ||      \
     ((x) == I2C_SR_MSL) ||         \
     ((x) == I2C_SR_BUSY) ||        \
     ((x) == I2C_SR_TRA) ||         \
     ((x) == I2C_SR_GENCALLF) ||    \
     ((x) == I2C_SR_SMBDEFAULTF) || \
     ((x) == I2C_SR_SMBHOSTF) ||    \
     ((x) == I2C_SR_SMBALRTF))

/*! Parameter check for writeable I2C status bit !*/
#define IS_VALID_WR_STATUS_BIT(x) \
    (((x) == I2C_SR_MSL) ||       \
     ((x) == I2C_SR_TRA))

/*! Parameter check for I2C mode !*/
#define IS_VALID_I2C_MODE(x) \
    (((x) == I2cMaster) ||   \
     ((x) == I2cSlave))

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

