MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_i2c.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static uint8_t u8FreqDiv[8] = {1, 2, 4, 8, 16, 32, 64, 128};

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief  static function for baudrate calculating
 **
 ** \param  [in] fDiv      Divisor value input in float type
 **
 ** \retval uint8_t        Divisor value output
 **
 ** \note   None
 **
 ******************************************************************************/
static uint8_t GetFreqReg(float fDiv)
{
    uint8_t u8Reg = 0u;

    for (uint8_t i = 7u; i > 0u; i--)
    {
        if (fDiv >= (float)u8FreqDiv[i - 1u])
        {
            u8Reg = i;
            break;
        }
    }

    return u8Reg;
}

/**
 *******************************************************************************
 ** \brief  Set the baudrate for I2C peripheral.
 **
 ** \param [in] pstcI2Cx           Pointer to the I2C peripheral register, can
 **                                be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] u32Baudrate        The value of baudrate.
 ** \param [in] u32SclTime         The SCL Rise and Falling timer(Number of period of pclk3)
 ** \param [in] u32Pclk3           Frequency of pclk3
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_BaudrateConfig(M4_I2C_TypeDef *pstcI2Cx, uint32_t u32Baudrate, uint32_t u32SclTime, uint32_t u32Pclk3)
{
    float fDivIndex = 0.0f;
    uint8_t u8DivIndex;
    uint32_t width = 0ul;
    uint32_t dnfsum = 0ul, divsum = 0ul;
    uint32_t tmp = 0ul;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_SPEED(u32Baudrate));

    /* Judge digitial filter status*/
    if (1u == pstcI2Cx->FLTR_f.DNFEN)
    {
        dnfsum = pstcI2Cx->FLTR_f.DNF + 1ul;
    }
    else
    {
        dnfsum = 0ul;
    }
    divsum = 2ul; // default

    if (0ul != u32Baudrate)
    {
        tmp = u32Pclk3 / u32Baudrate - u32SclTime;
    }

    /* Calculate the pclk3 div */
    fDivIndex = (float)tmp / ((32.0f + (float)dnfsum + (float)divsum) * 2.0f);

    DDL_ASSERT(IS_VALID_FDIV(fDivIndex));

    u8DivIndex = GetFreqReg(fDivIndex);

    /* Judge if clock divider on*/
    if (0u == u8DivIndex)
    {
        divsum = 3ul;
    }
    else
    {
        divsum = 2ul;
    }
    width = tmp / u8FreqDiv[u8DivIndex];
    DDL_ASSERT(IS_VALID_BAUDWIDTH((width / 2ul) >= (dnfsum + divsum)));

    /* Write register */
    pstcI2Cx->CCR_f.FREQ = u8DivIndex;
    pstcI2Cx->CCR_f.SLOWW = width / 2ul - dnfsum - divsum;
    pstcI2Cx->CCR_f.SHIGHW = width - width / 2ul - dnfsum - divsum;
}

/**
 *******************************************************************************
 ** \brief De-initialize I2C unit
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 **
 ** \retval Ok                      Process finished.
 **
 ******************************************************************************/
en_result_t I2C_DeInit(M4_I2C_TypeDef *pstcI2Cx)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));

    /* Reset peripheral register and internal status*/
    pstcI2Cx->CR1_f.PE = 0u;
    pstcI2Cx->CR1_f.SWRST = 1u;
    return Ok;
}

/**
 *******************************************************************************
 ** \brief Initialize I2C peripheral according to the structure
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] pstcI2C_InitStruct  Pointer to I2C configuration structure
 **
 ** \retval Ok                      Process finished.
 ** \retval ErrorInvalidParameter   Parameter error.
 **
 ******************************************************************************/
en_result_t I2C_Init(M4_I2C_TypeDef *pstcI2Cx, const stc_i2c_init_t *pstcI2C_InitStruct)
{
    en_result_t enRes = Ok;
    if ((NULL == pstcI2C_InitStruct) || (NULL == pstcI2Cx))
    {
        enRes = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
        DDL_ASSERT(IS_VALID_I2C_MODE(pstcI2C_InitStruct->enI2cMode));
        DDL_ASSERT(IS_VALID_SPEED(pstcI2C_InitStruct->u32Baudrate));

        /* Register and internal status reset */
        pstcI2Cx->CR1_f.PE = 0u;
        pstcI2Cx->CR1_f.SWRST = 1u;

        pstcI2Cx->CR1_f.PE = 1u;

        I2C_BaudrateConfig(pstcI2Cx,
                           pstcI2C_InitStruct->u32Baudrate,
                           pstcI2C_InitStruct->u32SclTime,
                           pstcI2C_InitStruct->u32Pclk3);

        pstcI2Cx->CR1_f.ENGC = 0u;
        pstcI2Cx->CR1_f.SWRST = 0u;
        pstcI2Cx->CR1_f.PE = 0u;
    }
    return enRes;
}

/**
 *******************************************************************************
 ** \brief I2C function command
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_Cmd(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

    pstcI2Cx->CR1_f.PE = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C SMBUS function configuration
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] pstcI2C_SmbusInitStruct
 **                                 Pointer to I2C SMBUS configuration structure
 **
 ** \retval Ok                      Process finished.
 ** \retval ErrorInvalidParameter   Parameter error.
 **
 ******************************************************************************/
en_result_t I2C_SmbusConfig(M4_I2C_TypeDef *pstcI2Cx, const stc_i2c_smbus_init_t *pstcI2C_SmbusInitStruct)
{
    en_result_t enRet = Ok;
    if (NULL != pstcI2C_SmbusInitStruct)
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
        DDL_ASSERT(IS_VALID_FUNCTION_STATE(pstcI2C_SmbusInitStruct->enHostAdrMatchFunc));
        DDL_ASSERT(IS_VALID_FUNCTION_STATE(pstcI2C_SmbusInitStruct->enDefaultAdrMatchFunc));
        DDL_ASSERT(IS_VALID_FUNCTION_STATE(pstcI2C_SmbusInitStruct->enAlarmAdrMatchFunc));

