MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_i2c.c
        pstcI2Cx->CR1_f.SMBHOSTEN = pstcI2C_SmbusInitStruct->enHostAdrMatchFunc;
        pstcI2Cx->CR1_f.SMBDEFAULTEN = pstcI2C_SmbusInitStruct->enDefaultAdrMatchFunc;
        pstcI2Cx->CR1_f.SMBALRTEN = pstcI2C_SmbusInitStruct->enAlarmAdrMatchFunc;
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief I2C SMBUS function command
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_SmBusCmd(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

    pstcI2Cx->CR1_f.SMBUS = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C software reset function command
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_SoftwareResetCmd(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

    pstcI2Cx->CR1_f.SWRST = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C digital filter function configuration
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enDigiFilterMode    Chose the digital filter mode, This parameter
 **                                 can be one of the following values:
 **                                 Filter1BaseCycle
 **                                 Filter2BaseCycle
 **                                 Filter3BaseCycle
 **                                 Filter4BaseCycle
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_DigitalFilterConfig(M4_I2C_TypeDef *pstcI2Cx, en_i2c_digital_filter_mode_t enDigiFilterMode)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_DIGITAL_FILTER(enDigiFilterMode));

    pstcI2Cx->FLTR_f.DNF = enDigiFilterMode;
}

/**
 *******************************************************************************
 ** \brief I2C digital filter function command
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_DigitalFilterCmd(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

    pstcI2Cx->FLTR_f.DNFEN = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C analog filter function command
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_AnalogFilterCmd(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

    pstcI2Cx->FLTR_f.ANFEN = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C general call function command
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_GeneralCallCmd(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

    pstcI2Cx->CR1_f.ENGC = enNewState;
}

/**
 *******************************************************************************
 ** \brief I2C slave address0 config
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \param [in] enAdrMode           Address mode,can be Adr7bit or Adr10bit
 ** \param [in] u8Adr               The slave address
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_SlaveAdr0Config(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState, en_address_bit_t enAdrMode, uint8_t u8Adr)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));
    DDL_ASSERT(IS_VALID_ADRMODE(enAdrMode));

    pstcI2Cx->SLR0_f.SLADDR0EN = enNewState;
    pstcI2Cx->SLR0_f.ADDRMOD0 = enAdrMode;
    if (Adr7bit == enAdrMode)
    {
        pstcI2Cx->SLR0_f.SLADDR0 = ((uint32_t)u8Adr & 0x7Ful) << 1ul;
    }
    else
    {
        pstcI2Cx->SLR0_f.SLADDR0 = (uint32_t)u8Adr;
    }
}

/**
 *******************************************************************************
 ** \brief I2C slave address1 config
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the I2Cx function, can be
 **                                 Disable or Enable the function
 ** \param [in] enAdrMode           Address mode,can be Adr7bit or Adr10bit
 ** \param [in] u8Adr               The slave address
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_SlaveAdr1Config(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState, en_address_bit_t enAdrMode, uint8_t u8Adr)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));
    DDL_ASSERT(IS_VALID_ADRMODE(enAdrMode));

    pstcI2Cx->SLR1_f.SLADDR1EN = enNewState;
    pstcI2Cx->SLR1_f.ADDRMOD1 = enAdrMode;
    pstcI2Cx->SLR1_f.SLADDR1 = u8Adr;
}

/**
 *******************************************************************************
 ** \brief I2C fast ACK config
 **
 ** \param [in] pstcI2Cx            Pointer to the I2C peripheral register, can
 ** \                               be M4_I2C1,M4_I2C2 or M4_I2C3.
 ** \param [in] enNewState          New state of the fast ACK function, can be
 **                                 Disable or Enable the function
 **
 ** \retval None
 **
 ******************************************************************************/
void I2C_FastAckConfig(M4_I2C_TypeDef *pstcI2Cx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_UNIT(pstcI2Cx));
    DDL_ASSERT(IS_VALID_FUNCTION_STATE(enNewState));

